'use client'

import styles from './page.module.css'

export default function ShippingPolicy() {
  return (
    <section className="section">
      <div className="container container-small ">
        <article className="page-content cms-page">
          <div style={{ maxWidth: 900, margin: '0 auto' }}>
            <div className="container container-small mt-12">
              <h1 className={styles.mainTitle}>Αποστολή και παράδοση</h1>
              
              <p className={styles.justifiedText}>
                Αποστέλουμε τα προϊόντα μας σε όλες τις χώρες της Ευρώπης των 27, το Ηνωμένο Βασίλειο και την Ελβετία. 
                Υπάρχουν κάποιοι περιορισμοί και εξαιρέσεις σε αποστολές στις λοιπές, εκτός Ελλάδας και Κύπρου, 
                Ευρωπαϊκές χώρες, που οφείλονται α) στον όγκο, β) το βάρος και γ) το είδος των προϊόντων. Για τις περιπτώσεις 
                αυτές θα ενημερώνεσαι στη διαδικασία του checkout, όπως και με σχετική αλληλογραφία για τις ενδεχόμενες 
                λύσεις.
              </p>

              <p className={styles.justifiedText}>
                Επιπλέον, αποστολές στο Ηνωμένο Βασίλειο και την Ελβετία μπορεί να επιβαρυνθούν με δασμούς και φόρους 
                (κυρίως φόρους, οι οποίοι, ενώ στην Ευρώπη των 27 είτε καταβάλλονται με την αγορά του προϊόντος είτε έχουν 
                καταργηθεί, στις χώρες αυτές καταβάλλονται στο Τελωνείο Εισαγωγής). Σε κάθε περίπτωση τέτοιας πιθανής 
                υποχρέωσης θα ειδοποιείσαι από την μεταφορική εταιρεία.
              </p>

              <p className={styles.justifiedText}>
                Στο σημείο αυτό επιθυμούμε να δηλώσουμε ότι στους άμεσους στόχους μας περιλαμβάνεται η δρομολόγηση 
                διαδικασιών ώστε να μπορούμε να προσφέρουμε την διανομή των προϊόντων στις χώρες αυτές με 
                προπληρωμένους δασμούς και φόρους, ώστε να μπορούν οι παραλήπτης να τα παραλαμβάνει ελεύθερα.
              </p>

              <p className={styles.justifiedText}>
                Στις τιμές πώλησης που αναφέρονται στις προϊοντικές μας σελίδες δεν συμπεριλαμβάνονται ΦΠΑ και 
                μεταφορικά, λόγω του ότι απευθυνόμαστε σε αγοραστές από διαφορετικές χώρες.
              </p>

              <ul className={styles.bulletList}>
                <li>
                  Για τους <strong>Μεμονωμένους Αγοραστές</strong>, ΦΠΑ και μεταφορικά υπολογίζονται στην διαδικασία του checkout 
                  (συντελεστής ΦΠΑ της χώρας παράδοσης και μεταφορικά με βάση τον ταχυδρομικό κώδικα).
                </li>
                <li>
                  Για τους <strong>Κατόχους Λίστας και τους Καλεσμένους τους</strong>, τα είδη για τη δημιουργία μιας λίστας 
                  συμπεριλαμβάνουν τον ΦΠΑ με βάση τον τόπο παράδοσης που ορίζεται από τον κάτοχο της λίστας.
                </li>
              </ul>

              <p className={styles.justifiedText}>
                Επιπλέον, στους Κατόχους Λίστας προσφέρεται η επιλογή της συνολικής αποστολής των αγορασμένων δώρων, 
                μετά την ολοκλήρωση της λίστας.
              </p>

              <p className={styles.justifiedText}>
                Σε κάθε περίπτωση στόχος μας είναι να προσφέρουμε τον άριστο συνδυασμό κόστους - ποιοτικής υπηρεσίας 
                μεταφορικών, συνεργαζόμενοι με τις καλύτερες εταιρείες logistics, ώστε να μπορούν οι πελάτες μας να 
                επικεντρωθούν στην σωστή επιλογή των ειδών.
              </p>
            </div>
          </div>
        </article>
      </div>
    </section>
  )
} 